<?php
  echo "IT用語";
  echo "<br><br><br>";


  echo "要件定義(要求仕様書)<br>";
  echo "要件定義とは、システム開発における工程のひとつでお客様の叶えたい要望をヒアリングしてまとめる作業。<br>
        要求仕様書とは、要望に沿って、費用、開発期間、注意点などを記載するドキュメントのことである。";
  echo "<br><br><br>";


  echo "単体テスト<br>";
  echo "単体テストとは、メソッドや関数などの1つ1つの小さな単位ごとに行うテストのことです。";
  echo "<br><br><br>";


  echo "結合テスト<br>";
  echo "結合テストとは、複数のモジュールを組み合わせて行うテストのことです。";
  echo "<br><br><br>";



  echo "テスト仕様書(どのようなもの、項目)";  echo "<br>";
  echo "どんな条件の元でどんなテストをするか洗い出してまとめた資料。<br>
        テストを実施した環境、実施するテストの内容、テストを実施するためのシステムの操作手順、テストの実行結果、テストを実施した年月日と担当者、障害報告等が必要な項目として存在する。";
  echo "<br><br><br>";



?>